# -*- coding: utf-8 -*-
"""
Created on Wed Mar 27 19:57:56 2019

@author: admin
"""

    
def main():
    demo_1 = ['是什么疾病','是什么病','是哪些病的症状','是怎么了','是为什么','是怎么回事']
    demo_dis_sym_2 =['的症状是什么','的症状有哪些','有什么表现','有什么症状','的症状是怎样的']
    demo_dis_3 =['应该吃什么药','药有哪些','可以吃哪些药','应该怎么办','该如何治疗','怎样控制','用什么药','治疗方法']
    demo_sym_8 = ['应该做什么','']
    demo_drug_4 =['是治疗什么疾病的?','能治疗的疾病有哪些']
    demo_dis_dep_5 =['去哪个科','去哪个科室','应该去哪个科室']
    demo_dis_7 =['是干什么用的']
    sym = [
            '咳嗽',
            '关节腔内出血',
            '全身感染中毒症状',
            '豹纹状眼底',
            '神经痛',
            '眼前黑影',
            '气喘',
            '腹胀',
            '二尖瓣关闭不全',
            '恶心与呕吐',
            '气短',
            '长段升主动脉发育不全',
            '新生儿全身水肿',
            '面色苍白',
            '腹水',
            '肩痛',
            '胸痛',
            '红斑鳞屑',
            '疼痛',
            '热衰竭',
            '痰鸣音',
            '皮肤闪电疼痛',
            '出血倾向',
            '气促',
            '齿龈炎',
            '肚子疼',
            '牵涉痛',
            '头皮屑多',
            '异常矮小',
            '新生儿腹胀',
            '甲状腺肿',
            '气急喘盛',
            '假性前房积脓',
            '溶血现象',
            '桡骨头骨折',
            '阴茎疼痛',
            '恶性贫血',
            '无宫缩间歇',
            '鼻脓涕有臭味',
            '发烧',
            '溃疡',
            '肝臭',
            '状颅皮',
            '食欲减退',
            '鼻和喉部灼热感',
            '肝功能衰竭',
            '褐色尿',
            '真性菌尿',
            '尿糖',
            '糖尿病皮肤病变',
            '肤色赤红',
            '巨乳',
            '淋巴结肿大',
            '呼吸困难',
            '前阴寒冷',
            '气管隆突以上的损伤',
            '鳞屑',
            '肉芽肿',
            '肝气犯脾',
            '视网膜Roth斑',
            '胆囊运动障碍',
            '脾肾阳虚',
            '红斑结节',
            '鼻内发痒',
            '呼吸不规则',
            '记忆力障碍',
            '肌性肌无力',
            '红斑样皮疹',
            '心慌',
            '孤独症',
            '肌肉酸痛',
            '喉部有痰',
            '溃疡分泌物恶臭',
            '微循环障碍',
            '厌食',
            '肌肉发育不良',
            '紫绀',
            '静脉曲张',
            '胆囊运动障碍',
            '烦躁不安',
            '肚子疼',
            '血性腹水',
            '抽搐',
            '肛门剧痛',
            '低氧血症',
            '下消化道少量出血',
            '高热寒战',
            '呼吸异常',
            '眼外肌运动无力',
            '单眼失明',
            '阴道不规则出血',
            '虚脱',
            '感觉障碍',
            '小脑失调症',
            '水冲脉',
            '眼睑震颤',
            '皮肤瘙痒',
            '便秘伴剧烈腹痛',
            '间歇性跛行',
            '高耸而对称的T波',
            '高渗性昏迷',
            '颈部疼痛',
            '面色苍白',
            '腹膜刺激征',
            '丘疹',
            '脾肿大',
            '肌阵挛',
            '情绪起伏大',
            '咽痛',
            '结节',
            '腰膝酸软',
            '瘙痒',
            '水痘样皮疹',
            '足癣',
            '颈强直',
            '呼吸急促',
            '偏瘫',
            '心悸',
            '寒热交作',
            '昏迷',
            '口角生疮',
            '颈静脉怒张',
            '外斜V征',
            '排尿不畅',
            '扁桃体发炎',
            '高热寒战',
            '间歇性跛行',
            '窒息',
            '右上腹痛',
            '门脉高压',
            '智力发育迟缓',
            '声门水肿',
            '扁桃体肥大',
            '水肿',
            '突肤挺胸',
            '梳头或洗头时头发脱落增加',
            '腰部酸胀及无力',
            '鼓腮和吹口哨漏气',
            '四肢瘫痪',
            '指甲类似云母',
            '喘脱',
            '吞咽困难',
            '脊柱侧弯',
            '胸部紧迫或束带感',
            '淋巴结肿大',
            '眼球内积脓而失明'
            ]
    dis =[]
    f = open("G://毕设/数据/diseases.txt","r",encoding="utf-8")
    line = f.readline()
    while line:
        dis.append(line)
        line = f.readline()
    f.close()
    drug =[]
    f = open("G://毕设/数据/drugs.txt","r",encoding="utf-8")
    line = f.readline()
    while line:
        drug.append(line)
        line = f.readline()
    f.close()
    f = open("www.txt","w+",encoding="utf-8")
    count=0
    for a in drug:
        count+=1
        for te in demo_dis_7:
            le = len(a)
            let = len(te)
            f.write("7 "+a[:le-1]+te);
            f.write("\n")

    f.close()
    
main()
            

    